** General configuration
python, virtualenv, libtool, libtool-bin, and cmake all need to be present on your system for this to work wih all of the packages listed here. 

#+begin_src emacs-lisp :tangle "init.el" :mkdirp yes #+auto_tangle: t
  ;;; package init.el --- emacs init and config

  ;;; Code:

  (setq max-lisp-eval-depth 2048
        custom-safe-themes t
        epa-pinentry-mode 'loopback)

  (require 'package)
  (setq package-archives
        '(("gnu" . "http://elpa.gnu.org/packages/")
          ("melpa" . "http://melpa.org/packages/")))

  (recentf-mode) ;; keep track of recently opened files, useful for consult
  (global-visual-line-mode)

#+end_src

#+RESULTS:
#+begin_example

#+end_example

